; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	infrared0 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 infrared1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 Phenomenon7)
	(pointing satellite2 Planet6)
	(pointing satellite5 GroundStation2)
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared0)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 infrared1)
))

)

; plan
1. (turn_to satellite2 planet6 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet6)
   goals met: 2 of 10
2. (turn_to satellite1 groundstation3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 10
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 10
4. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 2 of 10
5. (turn_to satellite1 planet10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet10)
   goals met: 2 of 10
6. (take_image satellite1 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 3 of 10
7. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 10
8. (take_image satellite1 phenomenon9 instrument1 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 4 of 10
9. (turn_to satellite1 phenomenon5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon5)
   goals met: 4 of 10
10. (take_image satellite1 phenomenon5 instrument1 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 5 of 10
11. (turn_to satellite1 planet6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet6)
   goals met: 5 of 10
12. (take_image satellite1 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 6 of 10
13. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 6 of 10
14. (take_image satellite1 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 7 of 10
15. (turn_to satellite1 phenomenon7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 10
16. (take_image satellite1 phenomenon7 instrument1 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 9 of 10
17. (turn_to satellite5 groundstation2 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 groundstation2)
   goals met: 10 of 10
